In [1]:
# T test is used when we making inference about the population parameter and population standard deviation is not  given 
# Z test is used when we making inference about the population parameter and population standard deviation is   given

In [2]:
import numpy as np
import pandas as pd
df=pd.read_csv('titanic.csv')

In [49]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,male,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,male,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,male,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [50]:
# ztest
#population std is given
ch=df['age'].dropna().std()
ef=df['age'].dropna().mean()

In [51]:
#null hypothesis - the mean age of passengers is 31
#alternate hypothesis- the mean is age is more than 31
#confidence level is 95 percent

In [52]:
sam=df['age'].dropna().sample(30)

In [7]:
sam.mean()

31.916666666666668

In [8]:
import math as m
# z score
z=((sam.mean()-ef)*m.sqrt(30))/ch
print(z)

0.8361283471337189

In [9]:
p_value=1-0.4761

In [10]:
p_value

0.5239

In [11]:
if(p_value<0.05):
    print('reject null hypothesis')
else:
    print('accept null hypothesis')

accept null hypothesis

In [12]:
# t test
sam=df['age'].dropna().sample(30)

In [13]:
a=sam.mean()

In [14]:
d=sam.std()

In [15]:
t_value=((a-ef)*m.sqrt(30))/d
print(t_value)

-1.4873342003607115

In [16]:
from scipy.stats import t 
cdf_value=t.cdf(t_value,29)
print(cdf_value)

0.07385991958009067

In [25]:
if(cdf_value<0.05):
    print('reject null hypothesis')
else:
    print('accept null hypothesis')

accept null hypothesis

In [18]:
#q2
# in one tailed test the direction of hypothesis is mentioned 
# in two tailed test direction of the the hypthesis is not mentione

In [19]:
#q3
# type one error is the error of rejecting the null hypothesis when it is true
#type two error is accepting the null hypothesis when it is false
# for example the evidence not enough to prove a innocent person not guilty type one
# type 2 is accepting the  person innocent when he has actually committed the crime

In [21]:
#q4
# bayes theorem is caluculating the probablity of the event when the the probablity of the related events is given

In [48]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,male,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,male,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,male,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [66]:

# calculating the probablity of a male getting killed 
# probablity of being a male
p=577/891
print(p)

0.6475869809203143

(0, 15)

In [84]:
hj=pd.read_csv('titanic.csv')
hj.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [64]:
hj[hj['sex']=='male'].shape

(577, 15)

In [69]:
hj[hj['survived']==0].shape

(549, 15)

In [71]:
# probability of being killed in acciednt of titanic
z=549/891
print(z)

0.6161616161616161

In [75]:
hj[hj['survived']==0][hj['sex']=='male']

/tmp/ipykernel_1869/1963544099.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  hj[hj['survived']==0][hj['sex']=='male']

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
881,0,3,male,33.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [77]:
# probablity ofbeing a man and being killed
e=468/891
print(e)

0.5252525252525253

In [80]:
#probability of a random male taking titanic given getting killed
s=(e*p)/z
print('probability of a random male taking titanic given getting killed',s)

probability of a random male taking titanic given getting killed 0.5520413607845304

In [83]:

#q5
# confidence interval is infering about the the population parameter using sample statistic,with a paticular level of confidence level
# std of population parameter is given 
# confidence interval is 95%
error_margin= (0.05*ch)/m.sqrt(30)
print([a+error_margin,a-error_margin])

[25.5826081711743, 25.3173918288257]

In [85]:
#q6

# calculating the probablity of a male getting killed 
# probablity of being a male
p=577/891
print(p)

0.6475869809203143

In [86]:
hj=pd.read_csv('titanic.csv')
hj.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [87]:
hj[hj['sex']=='male'].shape

(577, 15)

In [88]:
hj[hj['survived']==0].shape

(549, 15)

In [89]:
# probability of being killed in acciednt of titanic
z=549/891
print(z)

0.6161616161616161

In [90]:
hj[hj['survived']==0][hj['sex']=='male']

/tmp/ipykernel_1869/1963544099.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  hj[hj['survived']==0][hj['sex']=='male']

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
881,0,3,male,33.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [94]:
# probablity ofbeing a man and being killed
e=468/891
print(e)

0.5252525252525253

In [95]:
#probability of a random male taking titanic given getting killed
s=(e*p)/z
print('probability of a random male taking titanic given getting killed',s)

probability of a random male taking titanic given getting killed 0.5520413607845304

In [96]:
#q7
#error=(0.05*5)/m.sqrt(n)
# sample size is not given the question

In [101]:
#q8
#error margin is  the taotal variation which comes while infereing about the population parameters from sample statistics
# it is subtracted and added  from the sample ststistic to give the range to population parameter prediction
# sample size and error term is inversely propotional

error_w=(0.05*5)/m.sqrt(50)
error_U=(0.05*5)/m.sqrt(100)
print('the difference can be seen clearly on the error term',(error_w,error_U))

the difference can be seen clearly on the error term (0.035355339059327376, 0.025)

In [102]:
#q9
#z score
#z=(75-70)m.sqrt(n)/5
# n is not given

In [103]:
#q10
# assuming that all assumptions of t t test clear
# t value
# population mean is not given

In [104]:
#q11
#sample standard deviation is not given

In [105]:
#q12
#data is mot given appropriately

In [108]:
#q13
error=(0.1*8)/m.sqrt(50)
C1=print([60+error,60-error])

[60.113137084989845, 59.886862915010155]

In [ ]:
#q14
# population mean is not given